package level1;

public class A못품_최대공약수와최소공배수 {

	public static void main(String[] args) {
		/*
		 * 문제 설명 
		 * 두 수를 입력받아 두 수의 최대공약수와 최소공배수를 반환하는 함수, solution을 완성해 보세요. 
		 * 배열의 맨 앞에 최대공약수, 그다음 최소공배수를 넣어 반환하면 됩니다. 
		 * 예를 들어 두 수 3, 12의 최대공약수는 3, 최소공배수는 12이므로
		 * solution(3, 12)는 [3, 12]를 반환해야 합니다.
		 * 
		 * 제한 사항
		 * 두 수는 1이상 1000000이하의 자연수입니다.
		 * 
		 */

	}
    public static int[] solution(int n, int m) {
    	/*
    	 * 내가 문제 푸는 방법
    	 *  8 13 // 1 2 4 8 : 1 13 => 최대공약수 1 , 최소 공배수 104
    	 *  6 8 // 1 2 3 6 : 1 2 4 8 => 최대공약수 2 , 최소 공배수 24 
    	 *  1 2 3 2 3 : 1 2 2 2 2 2 2 
    	 * 1. 최대 공약수는 공통된 약수에서 가장 큰 것.
     	 * 2. 최소 공배수는 현재 약수들에서 상대방이 되기위해 
    	 * 3.
    	 * 4.
    	 * 
    	 */
        int[] answer = {};
        return answer;
    }
}
